app/controllers/tweets_controller.rb

SELECT  `tweets`.* FROM `tweets` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2, 3)
---
  def index
    @tweets = Tweet.includes(:user).order("created_at DESC").page(params[:page]).per(5)

INSERT INTO `tweets` (`name`, `text`, `image`, `created_at`, `updated_at`) VALUES ('肉', 'a', 'https://tech-master.s3.amazonaws.com/uploads/curriculums/images/Rails1-4/sample.jpg', '2020-06-15 09:05:36', '2020-06-15 09:05:36')
---
  def create
    Tweet.create(tweet_params)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 8 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 8
---
  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
UPDATE `tweets` SET `image` = 'https://www.instagram.com/p/BfExmpTFno5/media/?size=l', `updated_at` = '2020-06-15 06:51:27' WHERE `tweets`.`id` = 1
---
  def update
    tweet = Tweet.find(params[:id])
    tweet.update(tweet_params)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
UPDATE `tweets` SET `text` = 'ya-', `updated_at` = '2020-06-15 07:40:25' WHERE `tweets`.`id` = 1
---
  def update
    tweet = Tweet.find(params[:id])
    tweet.update(tweet_params)

SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 10
---
  def show
    @comment = Comment.new
    @comments = @tweet.comments.includes(:user)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 11 LIMIT 1
---
  def set_tweeet
    @tweet = Tweet.find(params[:id])